import requests

tuna_url = input("Адрес от Tuna ")
url = "https://api.telegram.org/bot1733009188:AAGHGPl90XOlzrS0FvxAln3psWbXX0yzcaI/setWebhook"
params = {
    "url": f"{tuna_url}/schedule/tbot/"
}

try:
    response = requests.get(url, params=params)
    result = response.json()

    if result.get("ok"):
        print("✅ Вебхук успешно установлен.")
    else:
        print(f"⚠️ Не удалось установить вебхук: {result}")
except Exception as e:
    print(f"❌ Ошибка при выполнении запроса: {e}")


# {"☝️К матери": {"start": "5451", "finish": "5631", "check": ["3", "3з", "10", "10в", "10н", "14", "14л", "14п", "14р", "15", "15в"], "count": "1 час"}, "👇
# Домой": {"start": "5631", "finish": "5384", "check": ["3", "10", "10а", "10в", "14", "14л", "14р", "15"], "count": "1 час", "view": "По времени"},
# "Молодёжный центр - Рынок": {"start": "5503", "finish": "5596", "check": ["3", "5", "5л", "6", "6а", "6и", "8", "10", "10а", "10в", "11", "11п", "13а", "14р", "15", "16", "16п", "17", "17а", "20а", "21", "21з", "22п"]},
# "Дом культуры - Водоканал": {"start": "5384", "finish": "5443", "check": ["6", "6и"], "count": "1 час"}, "Рынок - ДК": {"start": "5584", "finish": "5451", "check": ["3", "3з", "5", "5и", "5л", "5п", "6", "6а", "6и", "8", "10", "10в", "10н", "11", "11п", "14п", "14р", "15", "15в", "16", "16п", "17а", "21", "21з", "22п"], "count": "30 минут"},
# "Молодёжный центр - Социалистическая": {"start": "5629", "finish": "5631", "check": ["14п", "14р", "10", "10в", "10н", "3", "3з", "14", "14л"], "count": "1 час", "view": "По времени"},
# "Гаспадарчая - Рынок": {"start": "64598", "finish": "5584", "check": ["6и", "4ц", "12", "12б", "12н", "19н", "4ш"]}, "Чехова - Рынок": {"start": "36856", "finish": "5596", "check": ["11", "16п", "17", "17а", "11п", "5", "20а", "7", "16"]},
# "Автовокзал - Дом культуры": {"start": "64730", "finish": "5451", "check": ["11", "17а", "6", "6а", "6и", "16"]}}
